import { defineConfig } from 'cypress';

// e2e тесты проводится для проверки работоспособности приложения с бд, то есть глобальную работоспособность. Все, что можно проверить отдельно и изолированно на фронте должно делаться за счет unit и интеграционного тестирования. е2е тестирование необходимо для тестирования пользовательского пути, то есть для тестирования совместной работоспособности серверной и клиентской части. Поддерживать е2е тесты сложнее всего. Они дороже всего
// делаем тестирование конкретной интеграции клиенсктого приложения с серверной частью

// здесь мы задаем определенные общие настройки для e2e тестирования
export default defineConfig({
	e2e: {
		setupNodeEvents(on, config) {
			// implement node event listeners here
		},
		// указываем базовый url frontend приложения
		// после указания базового url нам не нужно указывать полный адрес в тестах, а можем сразу писать относительные пути
		baseUrl: 'http://localhost:3000/',
	},
});
