import { lazy } from 'react';
// для чего мы вообще делаем код-сплитинг и используем lazy + suspense? без этого у нас будет формироваться единый бандл с js со всех страниц, хотя пользователь не хочет загружать все и сразу. это влияет не его время ожидания + сжирает трафик. мы будем разбивать код на чанки, чтобы пользователь загружал то, что ему нужно в конкретный момент
// мы уменьшаем размер нашего основного бандла
// нужно учесть, что использовать необходимо экспорты по дефолты (в AboutPage)
// стоит заметить, что при последующих переходах на уже загруженные страницы не будет происходить повторная загрузка чанков
export const AboutPageAsync = lazy(() => new Promise((resolve) => {
	// @ts-ignore
	// ТАК В РЕАЛЬНЫХ ПРОЕКТАХ НЕ ДЕЛАТЬ!!!!! ДЕЛАЕМ ДЛЯ КУРСА!
	setTimeout(() => resolve(import('./AboutPage')), 1500);
}));
